{
    "logo": "Diego Ruiz Martin | Professional Portfolio",
    "skills": "Skills",
    "education": "Education",
    "projects": "Projects",
    "subtitle-home": "Full Stack developer",
    "welcome": "Welcome to my professional portfolio",
    "hi": "Hi! My name is Diego, I am a fullstack developer and passionate about programmig. I invite you to get to know me a little more throguh my portfolio...",
    "aboutMe": "About me",
    "contact": "Contact",
    "aboutMeText-1": "In 2019, while I was finishing my degree in Chemical Engineering, I began exploring the world of programming through tutorials in HTML, CSS, JavaScript, and Java.",
    "aboutMeText-2": "As time went on, I decided to strengthen my skills by taking courses and training at various educational centers and institutes, successfully completing courses in graphic design, UX/UI design, among others.",
    "aboutMeText-3": "In July 2024 I completed a master's degree in FullStack Development, through which I learned new tools for web application development.",
    "aboutMeText-4": "And the journey has only just begun, I aspire to achieve my dream of becoming a senior programmer. I am constantly seeking opportunities that allow me to grow both personally and professionally, with the ambition of creating innovative and captivating solutions that bring together the best of technical development and visual design.",
    "aboutMeText-5": "I am proactive, dynamic, detail-oriented, a quick learner, and above all, I enjoy working in a team, contributing my part so that together, we can achieve any goals we set.",
    "engineer": "Chemical Engineer | 2019",
    "technician": "University Chemical Technician | 2018",
    "country": "Barcelona, Spain ",
    "nuclioDegree": "Full Stack Development | 2024",
    "cacJava": "Java Full Stack Development | 2021",
    "cacUxUi": "UX/UI Design | 2023",
    "cfpWeb": "Web pages design with Bootstrap 4 | 2021",
    "cfpGD": "Graphic Design | 2021",
    "specializations": "Specializations",
    "leadership": "Effective leadership for the 21st century | 2020",
    "google": "Google IT support | 2020",
    "management": "Management skills | 2020",
    "bsf": "Business strategic fundamentals | 2020",
    "courses": "Courses",
    "courseraB4": "Designing web pages with Bootstrap 4 | 2020",
    "html": "Introduction to HTML5",
    "bppm": "Basics of project planning and management | 2020",
    "fom": "Fundamentals of Management | 2020",
    "costs1": "Business Costs | 2020",
    "costs2": "International business I | 2020",
    "costs3": "International business II | 2020",
    "risks": "Risk management and projects changes administration | 2020",
    "analysis": "Introduction to cost analysis for business management | 2020",
    "projectsPlanning": "Project initiation and planning | 2020",
    "projectManagement": "Project management, the foundation of success | 2020",
    "formulation": "Formulation and evaluation of complex projects | 2020",
    "onlineCourses": "Online courses",
    "chokoladeDescription1": "This web development project was created for the pastry business Chokolade La Plata. Although the project was never published due to a client decision, the website is fully functional and designed to be completely responsive, adapting to different devices and screen sizes.",
    "chokoladeDescription2": "The development was carried out using HTML, CSS, and JavaScript, with Bootstrap as the framework to facilitate the creation of a modern and attractive design. The site reflects the spirit and quality of the brand, offering an intuitive and visually pleasing user experience, aligned with the needs of the pastry business. Through a combination of web development techniques and a focus on usability, the project proved to be a complete solution, ready to be implemented at any time.",
    "repository": "Repository",
    "lumaticDescription1": "This web development project was completed as the final master's project at Nuclio Digital School and is inspired by the event application lu.ma.",
    "lumaticDescription2": "The platform developed offers a comprehensive system for event management, with advanced features including authentication systems via email or mobile phone, utilizing JWT and LocalStorage for secure session management. Additionally, it supports two types of user roles: administrator and event creator, each with specific permissions and functionalities.",
    "lumaticDescription3": "The project also includes intuitive forms for event creation and editing, with image management handled through Cloudinary, enabling efficient uploading and manipulation of multimedia files. Users can subscribe to both cities and specific events, receiving real-time notifications through a websocket-based system. This system ensures that when an event is created in a specific city, online users subscribed to that city receive instant notifications. Moreover, an automated welcome email system has been implemented for new users.",
    "lumaticDescription4": "The platform was developed using technologies such as React JS for the frontend, Node.js and Express for the backend, and MongoDB for the database. To ensure the system's quality and stability, backend and End-to-End (E2E) testing was conducted using tools like Jest and Cypress. Overall, this project demonstrates a strong integration of various technologies with careful attention to user experience and system functionality.",
    "website": "Website",
    "simpleCalculator": "Simple Calculator",
    "simpleCalculatorDescription1": "This project involves the development of a simple calculator that performs basic operations, with features to prevent errors and options to change themes based on user preferences. The design is intended to provide an intuitive and efficient user experience.",
    "simpleCalculatorDescription2": "The development was carried out using HTML, CSS, and JavaScript, ensuring a robust functionality and user-friendly interface.",
    "simpleCalculatorDescription3": "The same calculator also was implemented using React JS, showcasing the design's flexibility and ability to adapt to different development technologies.",
    "jsRepository": "JavaScript calculator repository",
    "reactRepository": "React calculator repository",
    "todoDescription1": "This project involves the development of a task management application with a design inspired by Windows 95. The interface features a bottom toolbar that detects the current time and displays it on screen, emulating the look of a desktop from that era. The application allows users to create, edit, and delete tasks, as well as indicate the status of each task as 'completed' or 'not completed' using representative images.",
    "todoDescription2": "For creating or editing a task, a modal is displayed to provide a smooth and user-friendly experience. The frontend of the application is developed using React JS, enabling dynamic interactions, while the backend is implemented with Express and Node.js, ensuring efficient handling of the application's operations and data.",
    "feRepository": "Frontend repository",
    "beRepository": "Backend repository"
}