{
    "logo": "Diego Ruiz Martin | Portfolio Profesional",
    "skills": "Habilidades Tecnológicas",
    "education": "Formación",
    "projects": "Proyectos",
    "cv": "CV",
    "cvTitle": "Curriculum Vitae Diego Ruiz Martín",
    "subtitle-home": "Desarrollador Full Stack",
    "welcome": "Bienvenidos a mi portfolio profesional",
    "hi": "¡Hola! Mi nombre es Diego, soy desarrollador fullstack y un apasionado de la programación. Te invito a que me conozcas un poco más a través de mi portfolio...",
    "aboutMe": "Sobre mi",
    "contact": "Contacto",
    "aboutMeText-1": "Por el año 2019, mientras finalizaba la carrera de Ingeniería Química, comencé a incursionar en el mundo de la programación, mediante tutoriales de HTML, CSS, JavaScript y Java.",
    "aboutMeText-2": "Con el pasar del tiempo, decidí fortalecer mis habilidades realizando cursos y capacitaciones en distintos centros de formación e institutos, logrando finalizar exitosamente cursos de diseño gráfico, diseño UX/UI, entre otros.",
    "aboutMeText-3": "En julio de 2024 finalicé un master en FullStack Development, mediante el cual aprendí nuevas herramientas para el desarrollo de aplicaciones web.",
    "aboutMeText-4": "Y la carrera recién está empezando, quisiera poder lograr cumplir mi sueño de convertirme en un programador senior. Estoy en constante búsqueda de oportunidades que me permitan crecer tanto a nivel personal como profesional, con la ambición de crear soluciones innovadoras y cautivadoras que unan lo mejor del desarrollo técnico y el diseño visual.",
    "aboutMeText-5": "Soy proactivo, dinámico, orientado al detalle, aprendo rápido y sobre todo me gusta trabajar en equipo, aportar mi granito de arena para que así, entre todos, podamos lograr juntos los objetivos que se impongan.",
    "engineer": "Ingeniero Químico | 2019",
    "technician": "Técnico Químico Universitario | 2018",
    "country": "Barcelona, España ",
    "nuclioDegree": "Desarrollo Full Stack | 2024",
    "cacJava": "Desarrollo Full Stack Java | 2021",
    "cacUxUi": "Diseño UX/UI | 2023",
    "cfpWeb": "Diseño de páginas web con Bootstrap 4 | 2021",
    "cfpGD": "Diseño Gráfico | 2021",
    "specializations": "Especializaciones",
    "leadership": "Liderazgo efectivo para el siglo XXI | 2020",
    "google": "Soporte de tecnologías de la información de google | 2020",
    "management": "Habilidades gerenciales | 2020",
    "bsf": "Fundamentos estratégicos empresariales | 2020",
    "courses": "Cursos",
    "courseraB4": "Diseñando páginas web con Bootstrap 4 | 2020",
    "html": "Introducción a HTML5 | 2020",
    "bppm": "Aspectos básicos de la planificación y la gestión de proyectos | 2020",
    "fom": "Aspectos fundamentales de la gerencia | 2020",
    "costs1": "Costos para los negocios | 2020",
    "costs2": "Negocios Internacionales I | 2020",
    "costs3": "Negocios Internacionales II| 2020",
    "risks": "La gestión de los riesgos y la administración de los cambios en el proyecto | 2020",
    "analysis": "Introducción al análisis de costos para la dirección de empresas | 2020",
    "projectsPlanning": "Iniciación y planificación de proyectos | 2020",
    "projectManagement": "Gestión de proyectos, la base del éxito | 2020",
    "formulation": "Formulación y evaluación de proyectos complejos | 2020",
    "onlineCourses": "Cursos en línea",
    "chokoladeDescription1": "Proyecto de desarrollo web para el emprendimiento de pastelería Chokolade La Plata. Aunque el proyecto nunca pudo ser publicado por decisión del cliente, es completamente funcional y responsive.",
    "chokoladeDescription2": "Desarrollado en HTML, CSS y Javascript, utilizando Bootstrap como framework.",
    "repository": "Repositorio",
    "lumaticDescription1": "Proyecto de desarrollo web realizado como trabajo final de master en Nuclio Digital School.",
    "lumaticDescription2": "Desarrollado con React JS, Node JS, express, MongoDB, Cypress, Cloudinary among others",
    "website": "Sitio web",
    "simpleCalculator": "Calculadora Simple",
    "simpleCalculatorDescription1": "Proyecto de desarrollo de una calculadora simple, con operaciones básicas, posee funciones para evitar errores y funcionalidades de cambios de temas según la opción seleccionada.",
    "simpleCalculatorDescription2": "Desarrollado en HTML, CSS y Javascript.",
    "simpleCalculatorDescription3": "La misma calculadora fue realizada con React Js",
    "jsRepository": "Repositorio calculadora JavaScript",
    "reactRepository": "Repositorio calculadora React",
    "todoDescription1": "Proyecto de desarrollo de aplicación de tareas, con aspecto inspirado en Windows 95. Posee una barra de herramientas inferior que detecta la hora actual y la imprime en pantalla simulando el escritorio de un ordenador de aquella época. La app cuenta con operaciones de crear tareas, editarlas y eliminarlas. Posee además el estado de 'realizada' o 'no realizada' simbolizado con imágenes. Para crear o editar una tarea se despliega un modal.",
    "todoDescription2": "El frontend está desarrolaldo en React JS",
    "todoDescription3": "El backend está desarrollado con express y node JS",
    "feRepository": "Repositorio frontend",
    "beRepository": "Repositorio backend"
}